In [2]:
import pandas as pd
import csv
import os
import sqlite3

db = sqlite3.connect("first_database.db")
file2 = "Sacramentorealestatetransactions2.csv"
#file = "/Users/arnica/Documents/coding/Python_Jupyter/PythonForDataAnalysis/codeLou_Python/Sacramentorealestatetransactions2.csv"
#url = "https://raw.githubusercontent.com/mathcoder3141/blog-data-files/master/Congress_White_House.csv"
#url2 = "https://raw.githubusercontent.com/coryjennings93/codeLou_Python/master/Sacramentorealestatetransactions2.csv"


def run_query(query):
    return pd.read_sql_query(query,db)

In [12]:
os.path.isfile('file2')

False

In [13]:
os.path.isfile('/Users/arnica/Documents/coding/Python_Jupyter/PythonForDataAnalysis/codeLou_Python/Sacramentorealestatetransactions2.csv')

True

In [30]:
df = pd.read_csv(file2)
print(df)

             street        city    zip state  beds  baths  sqft         type  \
0      3526 HIGH ST  SACRAMENTO  95838    CA     2      1   836  Residential
1       51 OMAHA CT  SACRAMENTO  95823    CA     3      1  1167  Residential
2    2796 BRANCH ST  SACRAMENTO  95815    CA     2      1   796  Residential
3  2805 JANETTE WAY  SACRAMENTO  95815    CA     2      1   852  Residential
4   6001 MCMAHON DR  SACRAMENTO  95824    CA     2      1   797  Residential

                       saledate  price   latitude   longitude
0  Wed May 21 00:00:00 EDT 2008  59222  38.631913 -121.434879
1  Wed May 21 00:00:00 EDT 2008  68212  38.478902 -121.431028
2  Wed May 21 00:00:00 EDT 2008  68880  38.618305 -121.443839
3  Wed May 21 00:00:00 EDT 2008  69307  38.616835 -121.439146
4  Wed May 21 00:00:00 EDT 2008  81900  38.519470 -121.435768

In [31]:
df.to_sql("address", db, if_exists="replace")

In [33]:
query = """
SELECT city 
FROM address;
"""
run_query(query)

         city
0  SACRAMENTO
1  SACRAMENTO
2  SACRAMENTO
3  SACRAMENTO
4  SACRAMENTO

In [17]:
query = """
SELECT * 
FROM sqlite_master
ORDER BY name;
"""
run_query(query)

,type,name,tbl_name,rootpage,sql
0,table,address,address,2,"CREATE TABLE ""address"" (\n""index"" INTEGER,\n ..."
1,index,ix_address_index,address,3,"CREATE INDEX ""ix_address_index""ON ""address"" (""..."

In [18]:
#cur = db.cursor()

In [19]:
#cur.execute("select * from address;")

In [3]:
#cur.close()
db.close()